---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.CentroidHorizontal
source: html/a6c68150-d9b2-c3fd-3db9-14dece655a34.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular.CentroidHorizontal Property

Distance from centroid to the left extremites along horizontal axis.

## Syntax (C#)
```csharp
public double CentroidHorizontal { get; set; }
```